plantdoctor/app/controllers/leave_damages_controller.rb

  def create
    @leave_damage = LeaveDamage.new(leave_damage_params)

    if @leave_damage.save
---
INSERT INTO "leave_damages" ("wetBrown", "dryBrown", "yellow", "losingLeaves", "parasites", "plant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["wetBrown", 1], ["dryBrown", 0], ["yellow", 0], ["losingLeaves", 0], ["parasites", ""], ["plant_id", 3], ["created_at", "2021-07-01 14:58:17.914593"], ["updated_at", "2021-07-01 14:58:17.914593"]]