plantdoctor/app/controllers/plants_controller.rb

  def create
    @plant = Plant.new(plant_params)

    if @plant.save
---
INSERT INTO "plants" ("name", "size", "watering", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Gurke"], ["size", 20], ["watering", "Jeden 2. Tag"], ["created_at", "2021-06-30 12:23:44.066924"], ["updated_at", "2021-06-30 12:23:44.066924"]]